src/Reports/АнализТорговойНаценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>АнализТорговойНаценки</Name>
			<Comment>Анализ торговой наценки</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте регламентированного учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДСУпр</Name>
					<Comment>Сумма в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия, по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/АлгоритмПолученияЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АлгоритмПолученияЦены</Name>
			<Comment>Алгоритм получения цены для данного типа цен. Задает список полей (аналитик), в разрезе которых происходит получение и установка цен.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
					<Comment>Получать цену только для номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоХарактеристике</Name>
					<Comment>Получать цену в разрезе характеристик. Если для характеристики цена не задана, то получается цена для номенклатуры</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЕдиницеИзмерения</Name>
					<Comment>Получать цену в разрезе единиц измерения. Если для единицы измерения цена не задана, то получается цена для номенклатуры</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Comment>Дополнительные характеристики номенклатуры</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.ТипыНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Comment>Дата изготовления серии номенклатуры</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>Срок годности</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Серийный номер номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категория качества номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядковый номер характеристики, по которому производиться сортировка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСахара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Негоциант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Comment>Полный текст строкового дополнительного реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Справки2ЕГАИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/АнализТорговойНаценки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА.

Процедура КомпоновщикПолучитьПоляОтбора(ОтборКомпоновки, УникальныеПоля = Неопределено)
	
	Если УникальныеПоля = Неопределено Тогда
		УникальныеПоля = Новый Структура;
	КонецЕсли;
	
	Для Каждого ТекОтбор Из ОтборКомпоновки.Элементы Цикл
		
		Если НЕ ТекОтбор.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			КомпоновщикПолучитьПоляОтбора(ТекОтбор, УникальныеПоля);
		Иначе
			ИмяОтбора = СокрЛП(ТекОтбор.ЛевоеЗначение);
			Если ИмяОтбора = "" Тогда
				Продолжить;
			КонецЕсли;
			
			ПозицияТочки = СтрНайти(ИмяОтбора, ".");
			Если ПозицияТочки > 0 Тогда
				ИмяОтбора = Лев(ИмяОтбора, ПозицияТочки);
			КонецЕсли;
			
			УникальныеПоля.Вставить(ИмяОтбора);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // КомпоновщикПолучитьПоляСтруктуры()


// формирует тест запроса по себестоимости
Функция ПолучитьТекстЗапросаЦенСебестоимости(Запрос)
	
	СоответствиеЗамен = Новый Соответствие;
	СоответствиеЗамен.Вставить("Поставщик", "Партия.Контрагент");
	СоответствиеЗамен.Вставить("Организация", "СкладКомпании.Организация");
	СоответствиеЗамен.Вставить("Подразделение", "СкладКомпании.ПодразделениеКомпании");  
	
	ОтборКомпоновки = КомпоновщикНастроек.Настройки.Отбор;
	
	ТекстОтбора = ОтчетыПлатформаСервер.КомпоновщикПолучитьТекстОтбора(ОтборКомпоновки.Элементы, ОтборКомпоновки.ДоступныеПоляОтбора, "", Запрос.Параметры, СоответствиеЗамен);
	
	Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЦенПоСебестоимости.СкладКомпании,
	|	ТаблицаЦенПоСебестоимости.Номенклатура,
	|	ТаблицаЦенПоСебестоимости.Партия,
	|	ТаблицаЦенПоСебестоимости.Партия.Контрагент КАК Поставщик,
	|	ТаблицаЦенПоСебестоимости.СтатусПартии КАК СтатусПартии,
	|	МИНИМУМ(ТаблицаЦенПоСебестоимости.Цена) КАК ЦенаМин,
	|	МАКСИМУМ(ТаблицаЦенПоСебестоимости.Цена) КАК ЦенаМакс,
	|	СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.Цена) КАК ЦенаСред
	|ПОМЕСТИТЬ ТаблицаЦенПоСебестоимости
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПартииТоваровКомпанииОбороты.СкладКомпании КАК СкладКомпании,
	|		ПартииТоваровКомпанииОбороты.Номенклатура КАК Номенклатура,
	|		ПартииТоваровКомпанииОбороты.Партия КАК Партия,
	|		ПартииТоваровКомпанииОбороты.СтатусПартии КАК СтатусПартии,
	|		ВЫБОР
	|			КОГДА ПартииТоваровКомпанииОбороты.КоличествоОборот = 0
	|				ТОГДА 0
	|			ИНАЧЕ ПартииТоваровКомпанииОбороты.СуммаОборот / ПартииТоваровКомпанииОбороты.КоличествоОборот
	|		КОНЕЦ КАК Цена
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровКомпании.Обороты(&ДатаНач, &ДатаКон, , "+ТекстОтбора+") КАК ПартииТоваровКомпанииОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ 
	|		ПартииТоваровКомпанииОстатки.СкладКомпании,
	|		ПартииТоваровКомпанииОстатки.Номенклатура,
	|		ПартииТоваровКомпанииОстатки.Партия,
	|		ПартииТоваровКомпанииОстатки.СтатусПартии,
	|		ВЫБОР
	|			КОГДА ПартииТоваровКомпанииОстатки.КоличествоОстаток = 0
	|				ТОГДА 0
	|			ИНАЧЕ ПартииТоваровКомпанииОстатки.СуммаОстаток / ПартииТоваровКомпанииОстатки.КоличествоОстаток
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонГраница, "+ТекстОтбора+") КАК ПартииТоваровКомпанииОстатки) КАК ТаблицаЦенПоСебестоимости
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦенПоСебестоимости.СкладКомпании,
	|	ТаблицаЦенПоСебестоимости.Номенклатура,
	|	ТаблицаЦенПоСебестоимости.Партия,
	|	ТаблицаЦенПоСебестоимости.СтатусПартии
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|";
	
	Возврат Текст;
	
КонецФункции

Функция ПолучитьТаблицуПодразделений(ПодразделениеЦены)
	
	ТаблицаПодразделений = Новый ТаблицаЗначений;
	ТаблицаПодразделений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаПодразделений.Колонки.Добавить("Уровень",       Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	
	Уровень     = 0;
	ТекРодитель = ПодразделениеЦены;
	Пока ЗначениеЗаполнено(ТекРодитель) Цикл
		НоваяСтрока = ТаблицаПодразделений.Добавить();
		НоваяСтрока.Уровень       = Уровень;
		НоваяСтрока.Подразделение = ТекРодитель;
		
		Уровень = Уровень + 1;
		ТекРодитель = ТекРодитель.Родитель;
	КонецЦикла;
	
	НоваяСтрока = ТаблицаПодразделений.Добавить();
	НоваяСтрока.Уровень       = Уровень;
	НоваяСтрока.Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	
	Возврат ТаблицаПодразделений;
	
КонецФункции

// формирует текст запроса по ценам
Функция ПолучитьТекстЗапросаТаблицыЦены(Запрос, ТипЦен, АлгоритмПолученияЦены)
	
	РабочийТипЦен = ТипЦен;
	ШаблонЦена = "ТаблицаЦен.Цена";
	
	// Если расчетная цена получим базовую цену
	Счетчик = 1;
	ТекстСоединенийПроцентыСкидкиНаценки = "";
	Пока РабочийТипЦен.Рассчитывается Цикл
		
		Если РабочийТипЦен.ПроцентыСкидкиНаценки.Количество()>0 Тогда
			
			ИмяТаблицы = "ПроцентыСкидкиНаценки" + Строка(Счетчик);
			ТекстСоединенийПроцентыСкидкиНаценки = ТекстСоединенийПроцентыСкидкиНаценки + "
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	Справочник.ТипыЦен.ПроцентыСкидкиНаценки КАК " + ИмяТаблицы + "
			|ПО
			|	" + ИмяТаблицы + ".Ссылка = &ТипЦены" + Строка(Счетчик) + "
			|	И ТаблицаЦен.Номенклатура.ТипНоменклатуры = " + ИмяТаблицы + ".ТипНоменклатуры";
			
			ШаблонЦена = "("+ШаблонЦена + "+" + ШаблонЦена + "*ЕСТЬNULL(" + ИмяТаблицы + ".ПроцентСкидкиНаценки/100, " + Формат(РабочийТипЦен.ПроцентСкидкиНаценки/100,"ЧРД=.; ЧН=0")+"))";
			
			Запрос.УстановитьПараметр("ТипЦены" + Строка(Счетчик), РабочийТипЦен);
			
			Счетчик = Счетчик + 1;
			
		ИначеЕсли РабочийТипЦен.ПроцентСкидкиНаценки <> 0 Тогда
			
			ШаблонЦена = "("+ШаблонЦена+"+"+ШаблонЦена+"*"+Формат(РабочийТипЦен.ПроцентСкидкиНаценки/100, "ЧРД=.")+")";
			
		КонецЕсли;
		
		РабочийТипЦен = РабочийТипЦен.БазовыйТипЦен;
		
	КонецЦикла;
	
	АлгоритмПолученияЦены = РабочийТипЦен.АлгоритмПолученияЦены;

	Если Не РабочийТипЦен.ВВалютеУчета Тогда
		Запрос.УстановитьПараметр("ВалютаЦены", РабочийТипЦен.ВалютаЦены);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипЦен", РабочийТипЦен);
	
	ТекстРезультат = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПодразделений.Подразделение КАК Подразделение,
	|	ТаблицаПодразделений.Уровень КАК Уровень
	|ПОМЕСТИТЬ
	|	ТаблицаПодразделений
	| ИЗ
	|	&ТаблицаПодразделений КАК ТаблицаПодразделений
	|ИНДЕКСИРОВАТЬ ПО
	|	Подразделение
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЦен.Контрагент КАК Контрагент,
	|	ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.Период КАК Период,
	|	ТаблицаПодразделений.Уровень КАК Уровень,
	|	ТаблицаЦен.Цена КАК Цена
	|ПОМЕСТИТЬ
	|	ВремТаблицаЦен
	|ИЗ
	|	ТаблицаПодразделений КАК ТаблицаПодразделений
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.Цены КАК ТаблицаЦен
	|ПО
	|	ТаблицаПодразделений.Подразделение = ТаблицаЦен.ПодразделениеКомпании
	|ГДЕ 
	|	ТаблицаЦен.Период<=&ДатаКон
	|	И ТипЦен = &ТипЦен
	|	И ТаблицаЦен.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	И ((ТаблицаЦен.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = ТаблицаЦен.Номенклатура.БазоваяЕдиницаИзмерения И ТаблицаЦен.ЕдиницаИзмерения.Коэффициент=1)
	|	ИЛИ (ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|	И НЕ ТаблицаЦен.Номенклатура.ТипНоменклатуры.УчетЦенТолькоВРазрезеДопПараметров))
	|{ГДЕ
	|	(Номенклатура).* КАК Номенклатура
	|	}
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаПодразделений
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЦен.Контрагент КАК Контрагент,
	|	ТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МАКСИМУМ(ТаблицаЦен.Период) КАК Период
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ВремТаблицаЦен КАК ТаблицаЦен
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦен.Контрагент,
	|	ТаблицаЦен.ДоговорВзаиморасчетов,
	|	ТаблицаЦен.Номенклатура,
	|	ТаблицаЦен.ЕдиницаИзмерения
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОптимальнаяТаблицаЦен.Контрагент КАК Контрагент,
	|	ОптимальнаяТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ОптимальнаяТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ОптимальнаяТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаЦен.Уровень КАК Уровень,
	|	МАКСИМУМ(ТаблицаЦен.Цена) КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦенПодразделений
	|ИЗ
	|	СрезПоследних КАК ОптимальнаяТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ВремТаблицаЦен КАК ТаблицаЦен
	|ПО
	|	ОптимальнаяТаблицаЦен.Номенклатура     = ТаблицаЦен.Номенклатура
	|	И ОптимальнаяТаблицаЦен.ЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения
	|	И ОптимальнаяТаблицаЦен.Период           = ТаблицаЦен.Период
	|ГДЕ
	|	НЕ ТаблицаЦен.Цена = 0
	|СГРУППИРОВАТЬ ПО
	|	ОптимальнаяТаблицаЦен.Контрагент,
	|	ОптимальнаяТаблицаЦен.ДоговорВзаиморасчетов,
	|	ОптимальнаяТаблицаЦен.Номенклатура,
	|	ОптимальнаяТаблицаЦен.ЕдиницаИзмерения,
	|	ТаблицаЦен.Уровень
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ВремТаблицаЦен
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследних
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЦенПодразделений.Контрагент КАК Контрагент,
	|	ТаблицаЦенПодразделений.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ТаблицаЦенПодразделений.Номенклатура КАК Номенклатура,
	|	ТаблицаЦенПодразделений.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	МИНИМУМ(ТаблицаЦенПодразделений.Уровень) КАК Уровень
	|ПОМЕСТИТЬ
	|	СрезПоследних
	|ИЗ
	|	ТаблицаЦенПодразделений КАК ТаблицаЦенПодразделений
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЦенПодразделений.Контрагент,
	|	ТаблицаЦенПодразделений.ДоговорВзаиморасчетов,
	|	ТаблицаЦенПодразделений.Номенклатура,
	|	ТаблицаЦенПодразделений.ЕдиницаИзмерения
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОптимальнаяТаблицаЦен.Контрагент КАК Контрагент,
	|	ОптимальнаяТаблицаЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	ОптимальнаяТаблицаЦен.Номенклатура КАК Номенклатура,
	|	ОптимальнаяТаблицаЦен.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	" + ШаблонЦена + "*КурсыВалютСрезПоследних.Курс/ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Цена
	|ПОМЕСТИТЬ
	|	ТаблицаЦен
	|ИЗ
	|	СрезПоследних КАК ОптимальнаяТаблицаЦен
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ТаблицаЦенПодразделений КАК ТаблицаЦен
	|ПО
	|	ОптимальнаяТаблицаЦен.Номенклатура     = ТаблицаЦен.Номенклатура
	|	И ОптимальнаяТаблицаЦен.ЕдиницаИзмерения = ТаблицаЦен.ЕдиницаИзмерения
	|	И ОптимальнаяТаблицаЦен.Уровень          = ТаблицаЦен.Уровень
	|"+ ?(РабочийТипЦен.ВВалютеУчета, "ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютСрезПоследних
	|ПО ОптимальнаяТаблицаЦен.Номенклатура.ВалютаУчета = КурсыВалютСрезПоследних.Валюта","ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, Валюта=&ВалютаЦены) КАК КурсыВалютСрезПоследних
	|ПО ИСТИНА")+"
	|" + ТекстСоединенийПроцентыСкидкиНаценки + "
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|УНИЧТОЖИТЬ
	|	ТаблицаЦенПодразделений
	|;
	|
	|УНИЧТОЖИТЬ
	|	СрезПоследних
	|;
	|";
	
	Возврат ТекстРезультат;
	
КонецФункции // ПолучитьТекстЗапросаТаблицыЦены()

// формирует текст запроса отчета
Функция ПолучитьОсновнойЗапрос()
	
	ТипЦен            = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("ТипЦен",              КомпоновщикНастроек.Настройки);
	ПодразделениеЦены = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("ПодразделениеЦены",   КомпоновщикНастроек.Настройки);
	НачалоПериода        = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("НачалоПериода",    КомпоновщикНастроек.Настройки);
	КонецПериода         = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("КонецПериода",     КомпоновщикНастроек.Настройки);
	ПериодГраница  = ОтчетыПлатформаСервер.КомпоновщикПолучитьЗначениеПараметра("ПериодГраница",          КомпоновщикНастроек.Настройки);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКонГраница", ПериодГраница);
	Запрос.УстановитьПараметр("ДатаНач",        НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаКон",        КонецДня(КонецПериода));
	
	// Текст запроса по себестоимости
	ТекстЗапросаРезультат = ПолучитьТекстЗапросаЦенСебестоимости(Запрос);
	// Текст запроса по ценам
	АлгоритмПолученияЦены = Перечисления.АлгоритмПолученияЦены.ПоНоменклатуре;
	ТекстЗапросаРезультат = ТекстЗапросаРезультат + Символы.ПС + ПолучитьТекстЗапросаТаблицыЦены(Запрос, ТипЦен, АлгоритмПолученияЦены);
	// Таблица родителей подразделения
	ТаблицаПодразделений  = ПолучитьТаблицуПодразделений(ПодразделениеЦены);
	
	Запрос.УстановитьПараметр("ТаблицаПодразделений", ТаблицаПодразделений);
	
	ТекстСоединенияОбщейТаблицыЦен = "";
	ТекстВыборкиЦены = "";
	
	ТекстВыборкиПроцентов = ",
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) - СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.ЦенаСред) КАК СредНаценка,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) - МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин) КАК МинНаценка,
	|	МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) - МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс) КАК МаксНаценка,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) = СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.ЦенаСред) ТОГДА 0
	|		КОГДА СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.ЦенаСред) = 0 ТОГДА 100
	|	ИНАЧЕ (МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) - СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.ЦенаСред))/СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.ЦенаСред)*100
	|	КОНЕЦ КАК ПроцентСредНаценки,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) = МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин) ТОГДА 0
	|		КОГДА МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин) = 0 ТОГДА 100
	|	ИНАЧЕ (МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) - МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин))/МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин)*100
	|	КОНЕЦ КАК ПроцентМинНаценки,
	|	ВЫБОР
	|		КОГДА МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) = МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс) ТОГДА 0
	|		КОГДА МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс) = 0 ТОГДА 100
	|	ИНАЧЕ (МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) - МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс))/МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс)*100
	|	КОНЕЦ КАК ПроцентМаксНаценки";
	
	Если АлгоритмПолученияЦены=Перечисления.АлгоритмПолученияЦены.ПоХарактеристике Тогда
		
		ТекстВыборкиЦены = ТекстВыборкиЦены + ",
		|	МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) КАК Цена";
		
		ТекстСоединенияОбщейТаблицыЦен = ТекстСоединенияОбщейТаблицыЦен + "
		|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен
		|ПО
		|	ТаблицаЦенПоСебестоимости.Номенклатура = ТаблицаЦен.Номенклатура
		|	И ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
		
	ИначеЕсли АлгоритмПолученияЦены=Перечисления.АлгоритмПолученияЦены.ПоЕдиницеИзмерения Тогда
		ТекстВыборкиЦены = ТекстВыборкиЦены + ",
		|	МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) КАК Цена";
		
		ТекстВыборкиПроцентов = ",
		|	МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) - СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.ЦенаСред) КАК СредНаценка,
		|	МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) - МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин) КАК МинНаценка,
		|	МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) - МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс) КАК МаксНаценка,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) = СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.ЦенаСред) ТОГДА 0
		|		КОГДА МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин) = 0 ТОГДА 100
		|		ИНАЧЕ (МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) - МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин))/МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин)*100
		|	КОНЕЦ КАК ПроцентСредНаценки,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) = МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин) ТОГДА 0
		|		КОГДА МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин) = 0 ТОГДА 100
		|		ИНАЧЕ (МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) - МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин))/МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин)*100
		|	КОНЕЦ КАК ПроцентМинНаценки,
		|	ВЫБОР
		|		КОГДА МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) = МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс) ТОГДА 0
		|		КОГДА МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс) = 0 ТОГДА 100
		|		ИНАЧЕ (МАКСИМУМ(ЕСТЬNULL(ЕСТЬNULL(ТаблицаЦен.Цена, ТаблицаЦен2.Цена), 0)) - МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс))/МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс)*100
		|	КОНЕЦ КАК ПроцентМаксНаценки";
		
		ТекстСоединенияОбщейТаблицыЦен = "
		|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен
		|ПО 
		|	ТаблицаЦенПоСебестоимости.Номенклатура = ТаблицаЦен.Номенклатура
		|	И ТаблицаЦен.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен2
		|ПО 
		|	ТаблицаЦенПоСебестоимости.Номенклатура = ТаблицаЦен2.Номенклатура
		|	И ТаблицаЦен.Номенклатура ЕСТЬ NULL
		|	И ТаблицаЦен2.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
	Иначе
		ТекстВыборкиЦены = ТекстВыборкиЦены + ",
		|	МАКСИМУМ(ЕСТЬNULL(ТаблицаЦен.Цена, 0)) КАК Цена";
		ТекстСоединенияОбщейТаблицыЦен = "
		|ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен
		|ПО 
		|	ТаблицаЦенПоСебестоимости.Номенклатура = ТаблицаЦен.Номенклатура
		|	И ТаблицаЦен.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)";
	КонецЕсли;
	
	УникальныеПоля = Новый Структура;
	ОтчетыПлатформаСервер.КомпоновщикПолучитьПоляСтруктуры(КомпоновщикНастроек.Настройки.Структура, УникальныеПоля);
	КомпоновщикПолучитьПоляОтбора(КомпоновщикНастроек.Настройки.Отбор, УникальныеПоля);
	
	ТекстДопГруппировки = "";
	Если УникальныеПоля.Свойство("Контрагент") Тогда
		УникальныеПоля.Удалить("Контрагент");
		ТекстВыборкиЦены = ТекстВыборкиЦены + ",
		|	ЕСТЬNULL(ТаблицаЦен.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент";
		ТекстДопГруппировки = "ТаблицаЦен.Контрагент";
	КонецЕсли;
	
	Если УникальныеПоля.Свойство("ДоговорВзаиморасчетов") Тогда
		УникальныеПоля.Удалить("ДоговорВзаиморасчетов");
		ТекстВыборкиЦены = ТекстВыборкиЦены + ",
		|	ЕСТЬNULL(ТаблицаЦен.ДоговорВзаиморасчетов, ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)) КАК ДоговорВзаиморасчетов";
		ТекстДопГруппировки = ТекстДопГруппировки + ?(ПустаяСтрока(ТекстДопГруппировки), "", ", ") + "ТаблицаЦен.ДоговорВзаиморасчетов";
	КонецЕсли;
	
	Замены = Новый Структура;
	Замены.Вставить("Организация", "СкладКомпании.Организация");
	Замены.Вставить("Подразделение", "СкладКомпании.ПодразделениеКомпании"); 	
	ТекстВыборки      = "";
	ТекстГруппировки  = "";
	ИмяТаблицыЗапроса = "ТаблицаЦенПоСебестоимости";
	Для Каждого ТекЭлемент Из УникальныеПоля Цикл
		ВыражениеПоля = ?(Замены.Свойство(ТекЭлемент.Ключ), Замены[ТекЭлемент.Ключ], ТекЭлемент.Ключ);
		ТекстВыборки     = ТекстВыборки     + ?(ТекстВыборки     = "", "", ", ") + Символы.ПС + ИмяТаблицыЗапроса + "." + ВыражениеПоля + " КАК " + ТекЭлемент.Ключ;
		ТекстГруппировки = ТекстГруппировки + ?(ТекстГруппировки = "", "", ", ") + Символы.ПС + ИмяТаблицыЗапроса + "." + ВыражениеПоля;
	КонецЦикла;
	
	ТекстГруппировки = ?(ТекстГруппировки = "" И ПустаяСтрока(ТекстДопГруппировки), "", "СГРУППИРОВАТЬ ПО") + ТекстГруппировки + ?(НЕ ПустаяСтрока(ТекстГруппировки) И НЕ ПустаяСтрока(ТекстДопГруппировки), ", ", "") + ТекстДопГруппировки;
	
	Запрос.Текст = ТекстЗапросаРезультат+"
	|ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМин) КАК ЦенаМин,
	|	МАКСИМУМ(ТаблицаЦенПоСебестоимости.ЦенаМакс) КАК ЦенаМакс,
	|	СРЕДНЕЕ(ТаблицаЦенПоСебестоимости.ЦенаСред) КАК ЦенаСред," + ТекстВыборки + ТекстВыборкиЦены + ТекстВыборкиПроцентов + "
	|ИЗ
	|	ТаблицаЦенПоСебестоимости КАК ТаблицаЦенПоСебестоимости " + ТекстСоединенияОбщейТаблицыЦен + "
	|" + ТекстГруппировки;
	
	Возврат Запрос;
	
КонецФункции

// Стандартная процедура настройки схемы компоновщика данных
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПодразделениеЦены = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПодразделениеЦены"));
	Если НЕ ЗначениеЗаполнено(ПодразделениеЦены.Значение) Тогда
		ПодразделениеЦены.Значение = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
	КонецЕсли;
	
	ТипЦен = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипЦен"));
	Если НЕ ЗначениеЗаполнено(ТипЦен.Значение) Тогда
		ТипЦенПоУмолчанию = ПравоПользователя("ОсновнойТипЦенПродажи");
		Если НЕ ЗначениеЗаполнено(ТипЦенПоУмолчанию) Тогда
			ТипЦенПоУмолчанию = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
		КонецЕсли;
		ТипЦен.Значение = ТипЦенПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Запрос = ПолучитьОсновнойЗапрос();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаНаценки", Запрос.Выполнить());
	
	ОтчетыПлатформаСервер.ВывестиОтчет(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ВнешниеНаборыДанных);
	
КонецПроцедуры

// Проверяет настройки отчета на корректность заполнения, возвращает "истина", если корректно, "ложь" - если нет.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЕстьНоменклатура = ОтчетыПлатформаСервер.КомпоновщикЕстьПолеВСтруктуре("Номенклатура", КомпоновщикНастроек.Настройки.Структура);
	
	Если НЕ ЕстьНоменклатура Тогда
		ПолеПоиска = ОтчетыПлатформаСервер.КомпоновщикПолучитьПолеКомпоновки("Номенклатура");
		Счетчик = ОтчетыПлатформаСервер.КомпоновщикСчетчикУсловийПоля(ПолеПоиска, КомпоновщикНастроек.Настройки.Отбор);
		Если НЕ Счетчик = 1 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'В группировках должна присутствовать номенклатура.'");
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ТипЦен = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипЦен")).Значение;
	Если НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не задан тип цен.'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	ПодразделениеЦены = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПодразделениеЦены")).Значение;
	Если НЕ ЗначениеЗаполнено(ПодразделениеЦены) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Не задано подразделение цены.'");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
